---
kind: property
id: P:Autodesk.Revit.UI.IFCExternalServiceUIData.ParamId
source: html/d5433a86-63c6-8000-9aec-534abf5a81dd.htm
---
# Autodesk.Revit.UI.IFCExternalServiceUIData.ParamId Property

the parameter id

## Syntax (C#)
```csharp
public ElementId ParamId { get; }
```